<h1> Exercice 1 </h1>


Vous travaillez dans une entreprise de vente en ligne. Vous avez reçu des données de ventes journalières pour différents produits, réparties sur plusieurs listes. Votre tâche est de consolider ces données dans un DataFrame pour une analyse ultérieure.

1) Créez un DataFrame pandas à partir de ces listes
2) Définissez la colonnes products en tant qu'index
3) affichez les données de la ligne correspondant au produit "keyboard"
4) Réinitialisez finalement l'index de votre dataframe

In [1]:
dates = ['2023-01-01', '2023-01-01', '2023-01-02', '2023-01-02']
products = ['Keyboard', 'Mouse', 'Monitor', 'Mouse']
quantities = [3, 5, 2, 3]
unit_prices = [79.99, 25.50, 199.99, 25.50]

In [3]:
#1
import pandas as pd

df = pd.DataFrame({
    'Date': dates,
    'Product': products,
    'Quantity': quantities,
    'Unit Price': unit_prices
})
df

         Date   Product  Quantity  Unit Price
0  2023-01-01  Keyboard         3       79.99
1  2023-01-01     Mouse         5       25.50
2  2023-01-02   Monitor         2      199.99
3  2023-01-02     Mouse         3       25.50

In [4]:
#2
df.set_index('Product', inplace=True)

df

                Date  Quantity  Unit Price
Product
Keyboard  2023-01-01         3       79.99
Mouse     2023-01-01         5       25.50
Monitor   2023-01-02         2      199.99
Mouse     2023-01-02         3       25.50

In [5]:
#3
df.loc['Keyboard']

Date          2023-01-01
Quantity               3
Unit Price         79.99
Name: Keyboard, dtype: object

In [6]:
#4
df.reset_index(inplace=True)
df

    Product        Date  Quantity  Unit Price
0  Keyboard  2023-01-01         3       79.99
1     Mouse  2023-01-01         5       25.50
2   Monitor  2023-01-02         2      199.99
3     Mouse  2023-01-02         3       25.50

<h1> Exercice 2 </h1>

vous devez importer un fichier CSV "products_exercices.csv" contenant des données de produits pour une analyse ultérieure. Le fichier CSV a des spécificités que vous devez prendre en compte lors de l'importation : 
- Ignorez la première ligne du fichier qui est un commentaire.
- Utilisez le caractère séparateur ,.
- Les valeurs null sont représentées par la chaîne "Vide".
- Définissez la colonne product_id comme index du DataFrame.
- Importez uniquement les colonnes products, category, et price et ignorez les autres colonnes.

Extrait du fichier : 

//Ceci est un commentaire à ignorer <br>
product_id,products,category,price,stock <br>
1,Keyboard,Electronics,Vide,45 <br>
2,Mouse,Electronics,29.99,150 <br>
3,Monitor,Vide,199.99,Vide <br>
4,Desk,Furniture,149.99,30

In [11]:
import pandas as pd

df = pd.read_csv(
    'products_exercices.csv',
    skiprows=1,  # Ignorer les lignes qui commencent par '#'
    sep=',',  # Définir le séparateur de colonnes
    na_values='Vide',  # Définir la représentation des valeurs NaN
    usecols=['product_id','products', 'category', 'price'],  # Sélectionner seulement certaines colonnes
    index_col='product_id'  # Définir la colonne 'Produit' comme index
)

df

            products     category   price
product_id
1           Keyboard  Electronics     NaN
2              Mouse  Electronics   29.99
3            Monitor          NaN  199.99
4               Desk    Furniture  149.99

<h1> Exercice 3 </h1>

Vous travaillez pour une entreprise qui reçoit régulièrement des données de clients au format JSON. Les données sont structurées avec un objet parent nommé data, contenant une liste d'objets représentant les informations des clients. Votre tâche est d'importer ces données dans un DataFrame pour analyse et de les exporter en format JSON pour une utilisation ultérieure.

1) Importez les données JSON dans un DataFrame pandas. Assurez-vous de cibler l'objet data qui contient les informations nécessaires.
2) Exportez le DataFrame résultant en un nouveau fichier JSON.

In [8]:
#1
df_clients = pd.read_json('clients_exercices.json')
df_clients

                                                data
0  {'client_id': '1', 'name': 'Alice', 'age': 31,...
1  {'client_id': '2', 'name': 'Bob', 'age': 22, '...
2  {'client_id': '3', 'name': 'Charlie', 'age': 3...

In [9]:
cleaned_clients = pd.DataFrame(list(df_clients['data']))
cleaned_clients

  client_id     name  age                email
0         1    Alice   31    alice@example.com
1         2      Bob   22      bob@example.com
2         3  Charlie   35  charlie@example.com

In [10]:
#2
df.to_json('cleaned_clients.json')